answer_examples = [
    {
        "input": "국민연금 가입자는 어떻게 구분되나요?", 
        "answer": "제7조(가입자의 종류) 가입자는 사업장가입자, 지역가입자, 임의가입자 및 임의계속가입자로 구분한다."
    },
    {
        "input": "국민연금 가입기간은 어떻게 계산되나요?", 
        "answer": """① 국민연금 가입기간(이하 “가입기간”이라 한다)은 월 단위로 계산하되, 가입자의 자격을 취득한 날이 속하는 달의 다음 달부터 자격을 상실한 날의 전날이 속하는 달까지로 한다. 다만, 다음 각 호의 어느 하나에 해당하는 경우 자격을 취득한 날이 속하는 달은 가입기간에 산입하되, 가입자가 그 자격을 상실한 날의 전날이 속하는 달에 자격을 다시 취득하면 다시 취득한 달을 중복하여 가입기간에 산입하지 아니한다. <개정 2011. 6. 7.>
1. 가입자가 자격을 취득한 날이 그 속하는 달의 초일인 경우(자격 취득일이 속하는 달에 다시 그 자격을 상실하는 경우는 제외한다)
2. 임의계속가입자의 자격을 취득한 경우
3. 가입자가 희망하는 경우
② 가입기간을 계산할 때 연금보험료를 내지 아니한 기간은 가입기간에 산입하지 아니한다. 다만, 사용자가 근로자의 임금에서 기여금을 공제하고 연금보험료를 내지 아니한 경우에는 그 내지 아니한 기간의 2분의 1에 해당하는 기간을 근로자의 가입기간으로 산입한다. 이 경우 1개월 미만의 기간은 1개월로 한다.
③ 「국민건강보험법」 제13조에 따른 국민건강보험공단(이하 “건강보험공단”이라 한다)이 제90조제4항에 따라 근로자에게 그 사업장의 체납 사실을 통지한 경우에는 제2항 단서에도 불구하고 통지된 체납월(滯納月)의 다음 달부터 체납 기간은 가입기간에 산입하지 아니한다. 이 경우 그 근로자는 제90조제1항에도 불구하고 가입기간에 산입되지 아니한 체납기간에 해당하는 기여금 및 부담금을 건강보험공단에 낼 수 있으며, 다음 각 호에 따른 기간을 가입기간에 산입한다.<개정 2008. 2. 29., 2009. 5. 21., 2010. 1. 18., 2011. 12. 31., 2021. 6. 8., 2021. 7. 27.>
1. 기여금 납부: 체납기간의 2분의 1에 해당하는 기간. 이 경우 1개월 미만의 기간은 1개월로 한다.
2. 기여금과 부담금 납부: 체납기간에 해당하는 기간
④ 제3항 후단에 따라 기여금 및 부담금을 납부할 때 월별 납부 기한으로부터 10년이 지난 경우에는 대통령령으로 정하는 이자를 더하여 납부하여야 한다.<신설 2021. 6. 8.>
⑤ 건강보험공단이 사용자가 체납한 연금보험료를 사용자로부터 납부받거나 징수한 경우에는 제3항 후단에 따라 근로자가 중복하여 낸 기여금 및 부담금을 해당 근로자에게 대통령령으로 정하는 이자를 더하여 돌려주어야 한다.<신설 2021. 6. 8.>
⑥ 제77조에 따라 지급받은 반환일시금이 제57조제1항에 따라 환수할 급여에 해당하는 경우 이를 반납하지 아니하는 때에는 그에 상응하는 기간을 가입기간에 산입하지 아니한다.
"""
    }
]